PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
#include <stdio.h>
#include <inttypes.h>
#include <string.h>
#include <sys/stat.h>
#include <unistd.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "custom_logging.h"
#include "nvs_flash.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "wifi_captive_portal.h"
#include "mqtt_manager.h"
#include "time_manager.h"
#include "watchdog_manager.h"
#include "relay_manager.h"
#include "connectivity_monitor.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "config_processor.h"
#include "esp_timer.h"
#include "spiffs_log.h"
#include "log_uploader.h"
#include "health_monitor.h"
#include "driver/uart.h"
#include "esp_spiffs.h"

static const char *TAG = "HDDESP32";

static bool g_system_initialized = false;
static bool g_wifi_connected = false;
static bool g_mqtt_connected = false;
static bool g_watchdog_available = false;
static bool g_relay_manager_initialized = false;
static bool g_need_reregister = false;
static bool g_connectivity_monitor_started = false;

static char g_mqtt_temp_topic[128];
static char g_esp32_id_buffer[ESP32_ID_LENGTH + 1];

static char g_pending_relay_configs[5][400];
static int g_pending_config_count = 0;
static bool g_system_ready_for_relays = false;

static SemaphoreHandle_t g_callback_mutex = NULL;
static SemaphoreHandle_t g_global_state_mutex = NULL;

typedef struct {
    char topic[128];
    char data[1024];
    int data_len;
    bool pending;
} deferred_mqtt_message_t;

static QueueHandle_t g_mqtt_message_queue = NULL;

static bool get_wifi_connected(void);
static bool get_mqtt_connected(void);
static bool get_relay_manager_initialized(void);
static void process_debug_commands(void);

static void setup_emergency_debug_support(void) {
    gpio_config_t debug_pin = {
        .pin_bit_mask = (1ULL << GPIO_NUM_0),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
    };
    gpio_config(&debug_pin);
    
    if (gpio_get_level(GPIO_NUM_0) == 0) {
        vTaskDelay(pdMS_TO_TICKS(200));
        if (gpio_get_level(GPIO_NUM_0) == 0) {
            esp_log_level_set("*", ESP_LOG_DEBUG);
            LOG_I(TAG, "=== EMERGENCY BOOT DEBUG MODE ACTIVATED ===");
            LOG_I(TAG, "GPIO0 was pressed during boot - ALL components in DEBUG mode");
        }
    }
    
    gpio_reset_pin(GPIO_NUM_0);
}

static void debug_connectivity_events(void) {
    int count = connectivity_monitor_get_pending_event_count();
    bool has_events = connectivity_monitor_has_pending_ram_events();
    
    size_t total_events, pending_events, memory_used;
    esp_err_t stats_ret = connectivity_monitor_get_ram_usage_stats(&total_events, &pending_events, &memory_used);
    
    if (stats_ret != ESP_OK) {
        LOG_E(TAG, "CRITICAL: Failed to get connectivity stats - possible memory corruption");
        watchdog_manager_force_reset("connectivity_stats_failure");
        return;
    }
    
    bool critical_failure = false;
    
    if (count > 0 && !has_events) {
        critical_failure = true;
        LOG_E(TAG, "CRITICAL: Event count mismatch - count=%d but no events found", count);
    }
    
    if (has_events && count == 0) {
        critical_failure = true;
        LOG_E(TAG, "CRITICAL: Event detection mismatch - events found but count=0");
    }
    
    if (pending_events > 20) {
        critical_failure = true;
        LOG_E(TAG, "CRITICAL: Event queue overflow - pending=%zu (max=20)", pending_events);
    }
    
    if (memory_used > 8192) {
        critical_failure = true;
        LOG_E(TAG, "CRITICAL: Connectivity memory leak - using %zu bytes", memory_used);
    }
    
    if (count > 0 || has_events || total_events > 10) {
        LOG_D(TAG, "Connectivity activity: events=%zu, pending=%zu, memory=%zu", 
              total_events, pending_events, memory_used);
    }
    
    if (critical_failure) {
        LOG_E(TAG, "CRITICAL: Connectivity system failure detected - forcing restart");
        watchdog_manager_force_reset("connectivity_critical_failure");
    }
}

static bool get_wifi_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_wifi_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_wifi_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_wifi_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_mqtt_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_mqtt_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_mqtt_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_mqtt_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_relay_manager_initialized(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_relay_manager_initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_relay_manager_initialized(bool initialized) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_relay_manager_initialized = initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static void process_debug_commands(void) {
    char rx_buffer[64];
    int len = uart_read_bytes(UART_NUM_0, rx_buffer, sizeof(rx_buffer) - 1, 50);
    
    if (len > 0) {
        rx_buffer[len] = '\0';
        
        for (int i = 0; i < len; i++) {
            if (rx_buffer[i] == '\n' || rx_buffer[i] == '\r') {
                rx_buffer[i] = '\0';
                break;
            }
        }
        
        if (strcmp(rx_buffer, "debug") == 0) {
            esp_log_level_set("*", ESP_LOG_DEBUG);
            printf("\n=== DEBUG MODE ACTIVATED - ALL COMPONENTS ===\n");
            printf("All ESP32 components will now show DEBUG logs\n");
            printf("Components: HDDESP32, RELAY_MGR, WIFI_MGR, MQTT_MGR, TIME_MGR, etc.\n\n");
        }
        else if (strcmp(rx_buffer, "info") == 0) {
            esp_log_level_set("*", ESP_LOG_INFO);
            printf("\n=== INFO MODE ACTIVATED - ALL COMPONENTS ===\n");
            printf("Back to normal: INFO, WARNING and ERROR logs only\n\n");
        }
        else if (strcmp(rx_buffer, "quiet") == 0) {
            esp_log_level_set("*", ESP_LOG_WARN);
            printf("\n=== QUIET MODE ACTIVATED - ALL COMPONENTS ===\n");
            printf("Only WARNING and ERROR logs will be shown\n\n");
        }
        else if (strcmp(rx_buffer, "verbose") == 0) {
            esp_log_level_set("*", ESP_LOG_VERBOSE);
            printf("\n=== VERBOSE MODE ACTIVATED - ALL COMPONENTS ===\n");
            printf("Maximum verbosity - ALL log levels will be shown\n\n");
        }
        else if (strcmp(rx_buffer, "help") == 0) {
            printf("\n=== ESP32 DEBUG COMMANDS ===\n");
            printf("debug             - Enable DEBUG logs for all components\n");
            printf("info              - Normal mode (INFO, WARN, ERROR)\n");
            printf("quiet             - Only WARN and ERROR logs\n");
            printf("verbose           - Maximum verbosity (all logs)\n");
            printf("status            - Show current system status\n");
            printf("spiffs_check      - Check SPIFFS filesystem status\n");
            printf("spiffs_format     - Format SPIFFS (requires confirmation)\n");
            printf("help              - Show this help\n\n");
        }
        else if (strcmp(rx_buffer, "status") == 0) {
            printf("\n=== SYSTEM STATUS ===\n");
            printf("WiFi: %s\n", get_wifi_connected() ? "CONNECTED" : "DISCONNECTED");
            printf("MQTT: %s\n", get_mqtt_connected() ? "CONNECTED" : "DISCONNECTED");
            printf("Relay Manager: %s\n", get_relay_manager_initialized() ? "INITIALIZED" : "NOT READY");
            printf("Memory: %lu bytes free\n", (unsigned long)esp_get_free_heap_size());

