PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
        case WIFI_MANAGER_STATE_AP_MODE:
            LOG_I(TAG, "WiFi AP mode active");
            set_wifi_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    LOG_D(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

static void on_wifi_connect_callback(void *user_data) {
    LOG_I(TAG, "WiFi configured via captive portal");
}

static void system_monitor_task(void *pvParameters) {
    LOG_I(TAG, "System monitor task started");
    
    bool task_registered = false;
    int registration_attempts = 0;
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    while (!task_registered && registration_attempts < 5) {
        if (g_watchdog_available) {
            esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
            if (wd_ret == ESP_OK) {
                LOG_I(TAG, "System monitor task registered in watchdog manager");
                task_registered = true;
                break;
            }
        }
        
        registration_attempts++;
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    
    uint32_t cycle_count = 0;
    bool portal_config_verified = false;
    int64_t connection_stable_start = 0;
    const int64_t VERIFICATION_DELAY_MS = 30000;
    static uint32_t uptime_hours = 0;
    const uint32_t QUARTERLY_RESTART_HOURS = 2160;
    uint32_t watchdog_feed_counter = 0;
    
    while (1) {
        if (task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                LOG_D(TAG, "Watchdog feed failed: %s", esp_err_to_name(feed_ret));
            }
        }
        
        cycle_count++;
        watchdog_feed_counter++;
        
        deferred_mqtt_message_t msg;
        BaseType_t msg_result = xQueueReceive(g_mqtt_message_queue, &msg, pdMS_TO_TICKS(100));
        
        if (watchdog_feed_counter % 2 == 0 && task_registered) {
            watchdog_manager_feed();
        }
        
        if (msg_result == pdTRUE) {
            process_deferred_mqtt_message(msg.topic, msg.data, msg.data_len);
            LOG_I(TAG, "Processed 1 MQTT message from queue");
        }
        
        if (cycle_count % 5 == 0) {
            process_debug_commands();
        }
        
        if (cycle_count % 1800 == 0 && get_relay_manager_initialized()) {
            if (task_registered) {
                watchdog_manager_feed();
            }
            relay_manager_check_all_states(false);
            if (task_registered) {
                watchdog_manager_feed();
            }
            relay_manager_verify_all_states();
        }
        
        if (cycle_count % 900 == 0 && get_relay_manager_initialized()) {
            LOG_D(TAG, "Performing scheduled relay system check");
            esp_err_t interrupt_check = relay_manager_verify_and_repair_interrupts();
            if (interrupt_check == ESP_FAIL) {
                LOG_W(TAG, "Relay system check reported issues");
            }
        }
        
        if (cycle_count % 30 == 0 && mqtt_manager_is_connected()) {
            int pending_count = connectivity_monitor_get_pending_event_count();
            bool has_pending = connectivity_monitor_has_pending_ram_events();
            
            if (has_pending || pending_count > 0) {
                LOG_I(TAG, "Found %d pending RAM connectivity events - processing", pending_count);
                esp_err_t ram_ret = connectivity_monitor_process_pending_events();
                if (ram_ret == ESP_OK) {
                    LOG_I(TAG, "RAM connectivity events processed successfully");
                } else {
                    LOG_W(TAG, "Failed to process RAM events: %s", esp_err_to_name(ram_ret));
                }
                
                int remaining = connectivity_monitor_get_pending_event_count();
                if (remaining > 0) {
                    LOG_W(TAG, "Still %d events pending after processing", remaining);
                }
            }
        }
        
        if (cycle_count % 1800 == 0) {
            debug_connectivity_events();
        }
        
        if (time_manager_should_send_network_info() || g_need_reregister) {
            LOG_I(TAG, "Sending network info");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                time_manager_mark_network_info_sent();
                g_need_reregister = false;
            }
        }
        
        if (cycle_count % 1800 == 0) {
            print_memory_info_simple();
        }
        
        if (cycle_count % 1800 == 0) {
            uptime_hours++;
            
            if (uptime_hours >= QUARTERLY_RESTART_HOURS) {
                LOG_I(TAG, "QUARTERLY RESTART: System has run %lu hours", uptime_hours);
                
                if (get_relay_manager_initialized()) {
                    relay_manager_save_current_states();
                    config_manager_force_commit();
                }
                
                vTaskDelay(pdMS_TO_TICKS(3000));
                esp_restart();
            }
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        bool time_synced = time_manager_is_synchronized();
        
        set_wifi_connected(wifi_connected);
        set_mqtt_connected(mqtt_connected);
        
        if (wifi_connected) {
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                if (mqtt_connected && time_synced && !portal_config_verified) {
                    if (connection_stable_start == 0) {
                        connection_stable_start = esp_timer_get_time() / 1000;
                        LOG_I(TAG, "Full connectivity detected, starting verification timer");
                    } else {
                        int64_t elapsed = (esp_timer_get_time() / 1000) - connection_stable_start;
                        if (elapsed >= VERIFICATION_DELAY_MS) {
                            LOG_I(TAG, "Configuration complete - restarting to STA mode");
                            vTaskDelay(pdMS_TO_TICKS(2000));
                            esp_restart();
                        } else {
                            int64_t remaining = (VERIFICATION_DELAY_MS - elapsed) / 1000;
                            if (cycle_count % 12 == 0) {
                                LOG_I(TAG, "Restart in %lld seconds", remaining);
                            }
                        }
                    }
                } else if (!mqtt_connected || !time_synced) {
                    connection_stable_start = 0;
                }
            }
            
            if (!time_manager_is_synchronized()) {
                time_manager_check_sync();
            }
            
            mqtt_manager_loop(100);
            
