PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
            if (mqtt_connected) {
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                if (cycle_count % 1800 == 0) {
                    LOG_I(TAG, "System OK - WiFi+MQTT connected");
                }
            } else {
                if (cycle_count % 36 == 0) {
                    if (cycle_count % 1800 == 0) {
                        LOG_I(TAG, "Retrying MQTT connection");
                    }
                    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                        mqtt_manager_connect();
                    }
                }
            }
        } else {
            connection_stable_start = 0;
            
            if (cycle_count % 10 == 0) {
                LOG_I(TAG, "WiFi disconnected - running recovery cycle");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 10);
            }
        }
        
        if (g_watchdog_available && cycle_count % 90 == 0) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                LOG_W(TAG, "System health degraded: %d", health);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

void app_main(void)
{
    ESP_ERROR_CHECK(log_storage_init());
    
    size_t log_size, prev_log_size;
    if (log_storage_get_info(&log_size, &prev_log_size) == ESP_OK) {
        ESP_LOGI(TAG, "Log system ready - current: %zu bytes, previous: %zu bytes", 
                 log_size, prev_log_size);
    }
    
    esp_log_set_vprintf(spiffs_vprintf);

    uart_config_t uart_config = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    uart_param_config(UART_NUM_0, &uart_config);
    uart_driver_install(UART_NUM_0, 512, 0, 0, NULL, 0);

    LOG_I(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");
    LOG_I(TAG, "UART driver initialized for debug commands");

    LOG_I(TAG, "Phase 1: Basic initialization");

    g_callback_mutex = xSemaphoreCreateMutex();
    g_global_state_mutex = xSemaphoreCreateMutex();
    
    g_mqtt_message_queue = xQueueCreate(8, sizeof(deferred_mqtt_message_t));
    if (g_mqtt_message_queue == NULL) {
        LOG_E(TAG, "Failed to create MQTT message queue");
        esp_restart();
    }
    
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        LOG_E(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        LOG_W(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(3000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            LOG_E(TAG, "Watchdog initialization failed twice: %s", esp_err_to_name(watchdog_ret));
            LOG_E(TAG, "CRITICAL: System cannot function safely without watchdog");
            vTaskDelay(pdMS_TO_TICKS(5000));
            esp_restart();
        }
    }
    
    LOG_I(TAG, "Watchdog manager initialized successfully");
    g_watchdog_available = true;
    
    watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
    
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    bool main_task_registered = false;
    int main_reg_attempts = 0;
    while (!main_task_registered && main_reg_attempts < 5) {
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret == ESP_OK) {
            LOG_I(TAG, "Main task registered in watchdog manager");
            main_task_registered = true;
        } else {
            LOG_W(TAG, "Main task registration attempt %d failed: %s", 
                    main_reg_attempts + 1, esp_err_to_name(reg_ret));
            main_reg_attempts++;
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    
    if (!main_task_registered) {
        LOG_E(TAG, "CRITICAL: Could not register main task in watchdog");
        esp_restart();
    }
    
    ESP_ERROR_CHECK(config_manager_init());
    if (main_task_registered) {
        esp_err_t feed_ret = watchdog_manager_feed();
        if (feed_ret != ESP_OK) {
            LOG_W(TAG, "Initial watchdog feed failed: %s", esp_err_to_name(feed_ret));
        }
    }

    // MULTI-LEVEL RECOVERY SYSTEM for mission-critical operations
    uint32_t boot_count = 0;
    nvs_handle_t check_handle;
    if (nvs_open("config", NVS_READONLY, &check_handle) == ESP_OK) {
        nvs_get_u32(check_handle, "boot_count", &boot_count);
        nvs_close(check_handle);
    }

    if (config_manager_check_boot_loop() != ESP_OK) {
        LOG_E(TAG, "BOOT LOOP DETECTED - Boot count: %lu", boot_count);
        watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);

        // ESCALATED RECOVERY STRATEGY based on boot count
        if (boot_count < 10) {
            // LEVEL 1: Soft recovery (first attempts)
            LOG_W(TAG, "RECOVERY LEVEL 1: Quick stabilization (boot #%lu)", boot_count);

            for (int i = 0; i < 60; i++) {  // Wait 1 minute
                if (main_task_registered) watchdog_manager_feed();
                if (i % 15 == 0) {
                    LOG_I(TAG, "L1: Stabilizing... %d/60s (heap: %lu)", i, esp_get_free_heap_size());
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
            }

            LOG_I(TAG, "L1: Quick recovery complete - Restarting");
            esp_restart();

        } else if (boot_count < 15) {
            // LEVEL 2: Safe mode with memory cleanup
            LOG_W(TAG, "RECOVERY LEVEL 2: Safe mode with cleanup (boot #%lu)", boot_count);

            // Attempt memory cleanup
            LOG_I(TAG, "L2: Performing emergency cleanup");
            // Add your cleanup here if available

            for (int i = 0; i < 180; i++) {  // Wait 3 minutes
                if (main_task_registered) watchdog_manager_feed();
                if (i % 30 == 0) {
                    LOG_I(TAG, "L2: Safe mode... %d/180s (heap: %lu)", i, esp_get_free_heap_size());
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
            }

            LOG_I(TAG, "L2: Clearing boot counter and restarting");
            config_manager_clear_boot_count();
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_restart();

        } else if (boot_count < 20) {
            // LEVEL 3: Extended safe mode + factory reset
            LOG_E(TAG, "RECOVERY LEVEL 3: Factory reset required (boot #%lu)", boot_count);

