PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
            // Notify server of critical situation
            LOG_E(TAG, "L3: CRITICAL - Multiple recovery attempts failed");

            for (int i = 0; i < 300; i++) {  // Wait 5 minutes
                if (main_task_registered) watchdog_manager_feed();
                if (i % 60 == 0) {
                    LOG_E(TAG, "L3: Factory reset pending... %d/300s (heap: %lu)",
                          i, esp_get_free_heap_size());
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
            }

            LOG_E(TAG, "L3: Erasing configuration and restarting");
            // Erase NVS config partition
            nvs_flash_erase_partition("nvs_config");
            config_manager_clear_boot_count();
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_restart();

        } else {
            // LEVEL 4: SURVIVAL MODE - Hardware fault suspected
            LOG_E(TAG, "========================================");
            LOG_E(TAG, "RECOVERY LEVEL 4: HARDWARE FAULT");
            LOG_E(TAG, "Boot count: %lu (CRITICAL THRESHOLD EXCEEDED)", boot_count);
            LOG_E(TAG, "========================================");
            LOG_E(TAG, "");
            LOG_E(TAG, "⚠️  DEVICE REQUIRES PHYSICAL INSPECTION");
            LOG_E(TAG, "⚠️  POSSIBLE HARDWARE FAILURE");
            LOG_E(TAG, "⚠️  DO NOT CONTINUE OPERATION WITHOUT INSPECTION");
            LOG_E(TAG, "");
            LOG_E(TAG, "Entering SURVIVAL MODE (minimal operation)");

            watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);

            // SURVIVAL MODE: Stay alive but don't restart
            // Allow monitoring and remote diagnostics
            uint32_t survival_time = 0;
            while(1) {
                if (main_task_registered) watchdog_manager_feed();

                if (survival_time % 60 == 0) {
                    LOG_E(TAG, "SURVIVAL MODE: %lu min | Heap: %lu | AWAITING MAINTENANCE",
                          survival_time / 60, esp_get_free_heap_size());
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
                survival_time++;

                // After 30 minutes in survival mode, clear counter and try ONE more time
                if (survival_time >= 1800) {
                    LOG_W(TAG, "SURVIVAL MODE: 30 min elapsed - Final recovery attempt");
                    config_manager_clear_boot_count();
                    vTaskDelay(pdMS_TO_TICKS(2000));
                    esp_restart();
                }
            }
        }
    }

    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)));
    LOG_I(TAG, "ESP32 ID: %s", g_esp32_id_buffer);
    log_uploader_start(g_esp32_id_buffer);

    // Initialize independent health monitor
    ESP_ERROR_CHECK(health_monitor_init(g_esp32_id_buffer));
    LOG_I(TAG, "Health monitor initialized");

    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    LOG_I(TAG, "MAC: %s", mac_address);
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    setup_emergency_debug_support();
    
    LOG_I(TAG, "Phase 2: Manager initialization");
    
    ESP_ERROR_CHECK(wifi_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(time_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(mqtt_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    esp_err_t conn_ret = connectivity_monitor_init();
    if (conn_ret != ESP_OK) {
        LOG_E(TAG, "Failed to initialize connectivity monitor: %s", esp_err_to_name(conn_ret));
    } else {
        LOG_I(TAG, "Connectivity monitor initialized");
        connectivity_monitor_set_event_callback(connectivity_event_callback, NULL);
    }
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    LOG_I(TAG, "Phase 3: Callback configuration");
    
    ESP_ERROR_CHECK(wifi_manager_set_state_callback(wifi_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_state_callback(mqtt_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_message_callback(mqtt_message_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_esp32_id(g_esp32_id_buffer));
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    char saved_client_id[32] = {0};
    char saved_panel_id[32] = {0};

    if (config_manager_get_str("client_id", saved_client_id, sizeof(saved_client_id)) == ESP_OK &&
        config_manager_get_str("panel_id", saved_panel_id, sizeof(saved_panel_id)) == ESP_OK &&
        strlen(saved_client_id) > 0 && strlen(saved_panel_id) > 0) {
        
        LOG_I(TAG, "Found saved configuration: client=%s, panel=%s", saved_client_id, saved_panel_id);
        mqtt_manager_set_panel_config(saved_client_id, saved_panel_id);
    }
    
    LOG_I(TAG, "Phase 4: WiFi connection");

    esp_err_t wifi_ret = wifi_manager_connect_saved();
    if (wifi_ret != ESP_OK) {
        char ap_ssid[33];
        ESP_ERROR_CHECK(wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel"));
        
        LOG_I(TAG, "No saved credentials - starting captive portal: %s", ap_ssid);
        ESP_ERROR_CHECK(wifi_captive_portal_start(ap_ssid, "firepanel"));
        ESP_ERROR_CHECK(wifi_captive_portal_set_on_connect_callback(on_wifi_connect_callback, NULL));
        
        if (g_watchdog_available) {
            watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
        }
    } else {
        LOG_I(TAG, "WiFi connection initiated - will connect in background");
    }
    
    LOG_I(TAG, "Phase 5: Creating system monitor task");
    
    TaskHandle_t monitor_task_handle = NULL;
    BaseType_t xReturned = xTaskCreate(
        system_monitor_task,
        "sys_monitor",
        12288,
        NULL,
        5,
        &monitor_task_handle
    );
    
    if (xReturned != pdPASS || monitor_task_handle == NULL) {
        LOG_E(TAG, "Failed to create system monitor task");
        LOG_E(TAG, "CRITICAL: System cannot function without monitor task");
        
        if (g_watchdog_available) {
            watchdog_manager_force_reset("monitor_task_creation_failed");
        } else {
            esp_restart();
        }
    }
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    g_system_initialized = true;
    LOG_I(TAG, "System initialization completed successfully");
    
