PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    uint32_t main_cycle = 0;
    uint32_t main_feed_errors = 0;
    
    while (1) {
        if (main_task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                main_feed_errors++;
                LOG_W(TAG, "Main task watchdog feed failed: %s (count: %lu)", 
                        esp_err_to_name(feed_ret), main_feed_errors);
                
                if (main_feed_errors >= 50) {
                    LOG_E(TAG, "Too many main feed failures, attempting re-registration");
                    watchdog_manager_unregister_task(NULL);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    
                    esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
                    if (reg_ret == ESP_OK) {
                        LOG_I(TAG, "Main task re-registered successfully");
                        main_feed_errors = 0;
                    } else {
                        LOG_E(TAG, "CRITICAL: Cannot re-register main task");
                        esp_restart();
                    }
                }
            } else {
                if (main_feed_errors > 0) {
                    main_feed_errors = 0;
                }
            }
        }
        
        main_cycle++;
        
        if (main_cycle % 20 == 0) {
            if (g_watchdog_available) {
                uint32_t feed_count, error_count;
                const char *last_reset_reason;
                
                if (watchdog_manager_get_stats(&feed_count, &error_count, &last_reset_reason) == ESP_OK) {
                    if (error_count > 200) {
                        LOG_W(TAG, "High watchdog error count: %lu (feeds: %lu, last reset: %s)", 
                                error_count, feed_count, last_reset_reason ? last_reset_reason : "none");
                    }
                }
                
                watchdog_mode_t current_mode = watchdog_manager_get_mode();
                if (current_mode == WATCHDOG_MODE_CRITICAL) {
                    LOG_W(TAG, "System running in CRITICAL mode");
                }
            }
        }
        
        if (main_cycle % 450 == 0) {
            size_t free_heap = esp_get_free_heap_size();
            size_t min_heap = esp_get_minimum_free_heap_size();
            LOG_I(TAG, "Main task: heap free=%zu min=%zu", free_heap, min_heap);
        }
        
        vTaskDelay(pdMS_TO_TICKS(8000));
    }
    
    if (get_relay_manager_initialized()) {
        LOG_I(TAG, "Cleaning up Relay Manager");
        relay_manager_deinit();
        set_relay_manager_initialized(false);
    }
    
    if (g_connectivity_monitor_started) {
        connectivity_monitor_stop();
        connectivity_monitor_deinit();
    }
}